## Problem 4 (*optional*) - Parsing daily temperatures

**This is an optional task for those who want more practice.**

This problem is more challenging as we provide only minimal instructions for completing the given tasks. You will need to search through the pandas documentation (and other resources) for help. We will cover data aggregation in more detail during Lesson 6, so this is a good opportunity to get a head start for next week!

In this problem, the aim is to aggregate the hourly temperature data for Helsinki Kumpula and Rovaniemi weather stations to the daily level. Currently, there are (at most) 3 measurements per hour in the data as you can see from the `YR--MODAHRMN` column (Year-Month-Day-Hour-Minute in Greenwich Mean Time (GMT):

```
    USAF  YR--MODAHRMN  TEMP  MAX  MIN  Celsius
0  28450  201705010000  31.0  NaN  NaN       -1
1  28450  201705010020  30.0  NaN  NaN       -1
2  28450  201705010050  30.0  NaN  NaN       -1
3  28450  201705010100  31.0  NaN  NaN       -1
4  28450  201705010120  30.0  NaN  NaN       -1
```

The output should contain mean, max, and min Celsius temperatures for each day (for example, one mean temperature value for the 1st of May and so on).

### What to do

- Your task is to summarize the information for each day by aggregating (grouping) the DataFrame.
- The output should be a new DataFrame where you have calculated the mean, max, and min Celsius temperatures for each day separately based on hourly values.
- Repeat the task for the two data sets you created in Problem 2 (May-August temperatures from Rovaniemi and Kumpula).

Don't forget to:

- Include useful comments in your code
- Push your solution to GitHub

### Hint

You can find help from the [Pandas Official documentation](https://pandas.pydata.org/pandas-docs/stable/) and Google. Don't hestiate to ask for tips in Slack!

In [1]:
import pandas as pd

kumpula = pd.read_csv(
    filepath_or_buffer="data/Kumpula_temps_May_Aug_2017.csv"
)
rovaniemi = pd.read_csv(
    filepath_or_buffer="data/Rovaniemi_temps_May_Aug_2017.csv"
)

In [6]:
kumpula['Date'] = pd.to_datetime(kumpula['YR--MODAHRMN'], format='%Y%m%d%H%M')

In [11]:
kumpula['Day'] = kumpula['Date'].dt.date # dt.date, obtain the date from pandas timestamp. the return type is python datatime.date
kumpula.tail()

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,Celsius,Date,Day
2919,11689,29980,201708311900,64.0,NaN,NaN,18,2017-08-31 19:00:00,2017-08-31
2920,11690,29980,201708312000,64.0,NaN,NaN,18,2017-08-31 20:00:00,2017-08-31
2921,11691,29980,201708312100,64.0,NaN,NaN,18,2017-08-31 21:00:00,2017-08-31
2922,11692,29980,201708312200,64.0,NaN,NaN,18,2017-08-31 22:00:00,2017-08-31
2923,11693,29980,201708312300,64.0,NaN,NaN,18,2017-08-31 23:00:00,2017-08-31

In [28]:
print(type(kumpula.at[0, 'Day']))
print(type(kumpula.at[0, 'Date']))
print(kumpula['USAF'].unique())

<class 'datetime.date'>
<class 'pandas._libs.tslibs.timestamps.Timestamp'>
[29980]

In [13]:
kumpula_groups = kumpula.groupby(['Day'])

In [26]:
from datetime import date
kumpula_groups.get_group(date(2017, 5, 1))

,Unnamed: 0,USAF,YR--MODAHRMN,TEMP,MAX,MIN,Celsius,Date,Day
0,8770,29980,201705010000,37.0,NaN,NaN,3,2017-05-01 00:00:00,2017-05-01
1,8771,29980,201705010100,37.0,NaN,NaN,3,2017-05-01 01:00:00,2017-05-01
2,8772,29980,201705010200,37.0,NaN,NaN,3,2017-05-01 02:00:00,2017-05-01
3,8773,29980,201705010300,37.0,NaN,NaN,3,2017-05-01 03:00:00,2017-05-01
4,8774,29980,201705010400,39.0,NaN,NaN,4,2017-05-01 04:00:00,2017-05-01
5,8775,29980,201705010500,41.0,NaN,NaN,5,2017-05-01 05:00:00,2017-05-01
6,8776,29980,201705010600,44.0,44.0,35.0,7,2017-05-01 06:00:00,2017-05-01
7,8777,29980,201705010700,45.0,NaN,NaN,7,2017-05-01 07:00:00,2017-05-01
8,8778,29980,201705010800,48.0,NaN,NaN,9,2017-05-01 08:00:00,2017-05-01
9,8779,29980,201705010900,51.0,NaN,NaN,11,2017-05-01 09:00:00,2017-05-01
10,8780,29980,201705011000,52.0,NaN,NaN,11,2017-05-01 10:00:00,2017-05-01
11,8781,29980,201705011100,51.0,NaN,NaN,11,2017-05-01 11:00:00,2017-05-01
12,8782,29980,201705011200,54.0,NaN,NaN,12,2017-05-01 12:00:00,2017-05-01
13,8783,29980,201705011300,49.0,NaN,NaN,9,2017-05-01 13:00:00,2017-05-01
14,8784,29980,201705011400,50.0,NaN,NaN,10,2017-05-01 14:00:00,2017-05-01
15,8785,29980,201705011500,52.0,NaN,NaN,11,2017-05-01 15:00:00,2017-05-01
16,8786,29980,201705011600,50.0,NaN,NaN,10,2017-05-01 16:00:00,2017-05-01
17,8787,29980,201705011700,52.0,NaN,NaN,11,2017-05-01 17:00:00,2017-05-01
18,8788,29980,201705011800,48.0,54.0,43.0,9,2017-05-01 18:00:00,2017-05-01
19,8789,29980,201705011900,48.0,NaN,NaN,9,2017-05-01 19:00:00,2017-05-01
20,8790,29980,201705012000,46.0,NaN,NaN,8,2017-05-01 20:00:00,2017-05-01
21,8791,29980,201705012100,44.0,NaN,NaN,7,2017-05-01 21:00:00,2017-05-01
22,8792,29980,201705012200,42.0,NaN,NaN,6,2017-05-01 22:00:00,2017-05-01
23,8793,29980,201705012300,39.0,NaN,NaN,4,2017-05-01 23:00:00,2017-05-01

In [27]:
len(kumpula_groups)

123

In [37]:
kumpula_day_records = pd.DataFrame()

for key, group in kumpula_groups:
    # Init an empty pd.Series
    result = pd.Series()

    # Drop index
    group.reset_index(drop=True, inplace=True)

    # Calculate the return values
    result['Day'] = key[0]
    result['USAF'] = group.at[0, 'USAF']
    result['MIN'] = group['Celsius'].min()
    result['MAX'] = group['Celsius'].max()
    result['MEAN'] = group['Celsius'].mean()

    # Convert to dateframe and transpose
    row = result.to_frame().transpose()

    # Concat
    kumpula_day_records = pd.concat([kumpula_day_records, row], ignore_index=True)

kumpula_day_records.head()

          Day   USAF MIN MAX      MEAN
0  2017-05-01  29980   3  12     7.625
1  2017-05-02  29980   2  16      9.75
2  2017-05-03  29980   4  13  9.208333
3  2017-05-04  29980   3  11  6.666667
4  2017-05-05  29980   2  17     10.25